{
  "intents": [
    {
      "tag": "greeting",
        "patterns": [
          "สวัสดี",
          "หวัดดี",
          "เป็นอย่างไรบ้าง",
          "มีใครอยู่ไหม",
          "สวัสดีค่ะ",
          "วันนี้วันดี",
          "สวัสดีครับ",
          "วันนี้เป็นอย่างไรบ้าง",
          "อรุณสวัสดิ์",
          "สวัสดีตอนเช้า",
          "สวัสดีตอนบ่าย",
          "สวัสดีตอนเย็น",
          "สวัสดีตอนดึก",
          "สวัสดีทุกคน",
          "สวัสดีครับผม",
          "สวัสดีจ้า",
          "สวัสดีเพื่อน",
          "หวัดดีครับ",
          "หวัดดีเพื่อน",
          "หวัดดีค่ะทุกคน",
          "เป็นไงบ้าง",
          "เป็นไงครับ",
          "มีใครอยู่หรือเปล่า",
          "มีใครออนไลน์อยู่ไหม",
          "มีใครฟังอยู่ไหม",
          "มีใครตอบได้ไหม",
          "สวัสดีค่ะทุกคน",
          "หวัดดีตอนนี้",
          "สวัสดีทุกท่าน",
          "วันนี้สวัสดี"
        ],
        "responses": [
          "หวัดดีค่ะ :-)",
          "สวัสดีค่ะ ยินดีต้อนรับนะคะ",
          "สวัสดีค่ะ มีอะไรให้ช่วยไหมคะ",
          "ว่าไงคะ มีอะไรให้ช่วยเหลือไหมคะ",
          "สวัสดีค่ะ มีอะไรให้ช่วยบ้างไหม",
          "สวัสดีค่ะวันนี้เป็นอย่างไรบ้าง",
          "สวัสดีค่ะ มีอะไรให้ช่วยไหม",
          "สวัสดีค่ะ ยินดีให้บริการนะคะ",
          "สวัสดีค่ะ มีอะไรให้ช่วยไหมคะ",
          "สวัสดีค่ะ วันนี้มีอะไรที่ต้องการถามไหม",
          "สวัสดีค่ะ ทุกคน",
          "สวัสดีค่ะ มีอะไรที่ต้องการช่วยไหมคะ",
          "สวัสดีค่ะ ยินดีต้อนรับค่ะ",
          "สวัสดีค่ะ ยินดีที่ได้เจอกันค่ะ",
          "สวัสดีค่ะ ขอให้วันนี้เป็นวันที่ดีนะคะ",
          "สวัสดีค่ะ มีอะไรที่ฉันช่วยได้ไหมคะ",
          "สวัสดีค่ะ ขอบคุณที่มาทักทายค่ะ",
          "สวัสดีค่ะ มีอะไรให้ฉันช่วยเหลือไหมคะ",
          "สวัสดีค่ะ ยินดีให้บริการค่ะ",
          "สวัสดีค่ะ ฉันสามารถช่วยอะไรได้บ้างคะ",
          "สวัสดีค่ะ วันนี้ต้องการความช่วยเหลืออะไรคะ",
          "สวัสดีค่ะ มีอะไรที่ต้องการสอบถามไหมคะ",
          "สวัสดีค่ะ ยินดีให้คำปรึกษาค่ะ",
          "สวัสดีค่ะ มีอะไรต้องการคำแนะนำไหมคะ",
          "สวัสดีค่ะ ยินดีที่ได้คุยกันค่ะ",
          "สวัสดีค่ะ ฉันสามารถช่วยอะไรได้บ้างคะ",
          "สวัสดีค่ะ ต้องการความช่วยเหลืออะไรไหมคะ",
          "สวัสดีค่ะ ยินดีต้อนรับทุกท่านค่ะ",
          "สวัสดีค่ะ วันนี้เป็นวันที่ดีค่ะ" 
        ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "ลาก่อน",
        "แล้วเจอกันใหม่",
        "สวัสดี"
      ],
      "responses": [
        "แล้วเจอกันใหม่นะคะ ขอบคุณที่แวะมา",
        "ขอให้มีความสุขนะคะ",
        "บ๊ายบาย! แวะมาใหม่ได้เสมอนะ"      
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "ขอบคุณ",
        "ขอบคุณมาก",
        "นี่มันมีประโยชน์มาก",
        "ขอบคุณมากๆ เลย"      
      ],
      "responses": [
        "ยินดีได้ช่วยค่ะ!",
        "ยินดีช่วยตลอดเลยค่ะ", 
        "ด้วยความยินดีค่ะ"
      ]
    },
    {
      "tag": "items",
      "patterns": [
        "มีสินค้าอะไรบ้าง",
        "ขายอะไรบ้าง",
        "มีสินค้าประเภทไหนให้เลือกบ้าง"
      ],
      "responses": [
        "เรามีกาแฟและชาจำหน่ายค่ะ",
        "เรามีทั้งกาแฟและชานะคะ"
      ]
    },
    {
      "tag": "payments",
      "patterns": [
        "รับบัตรเครดิตไหม",
        "รับมาสเตอร์การ์ดไหม",
        "จ่ายผ่าน Paypal ได้ไหม", 
        "จ่ายเป็นเงินสดอย่างเดียวเลยหรือ"
      ],
      "responses": [
        "เรารับทั้งบัตร VISA, Mastercard และ Paypal ค่ะ",
        "เรารับบัตรเครดิตชั้นนำส่วนใหญ่ และ Paypal ค่ะ"
      ]
    },
    {
      "tag": "delivery",
      "patterns": [
        "ส่งของนานแค่ไหน",
        "จัดส่งใช้เวลานานเท่าไร",
        "เมื่อไหร่สินค้าจะมาส่ง"  
      ],
      "responses": [
        "จัดส่งใช้เวลา 2-4 วันค่ะ",
        "การขนส่งใช้เวลา 2-4 วันค่ะ"
      ]
    }
  ]
}